//১. কখন const আর কখন let দিয়ে ভেরিয়েবল ডিক্লেয়ার করতে হয় সেটা তোমাকে জানতেই হবে। তুমি নিজে নিজে একটা const দিয়ে আরেকটা let দিয়ে ভেরিয়েবল ডিক্লেয়ার করে ফেলো।

const num = [2, 1, 2, 1, 2, 1, 5, 1, 2, 1, 2];
// num=['hello','tumi','kothai','aso'];
num.push(1000);
// console.log(num);

//let diea onk jai delear kora jai.
let num2 = [1, 2, 5, 15, 1, 5, 2, 1, 32, 1, 545, 4, 1, 1231, 231];
num2 = ["hello", "tumi", "kothai", "aso"];

num2.push(1000);
// console.log(num2);

//২. টেম্পলেট স্ট্রিং দিয়ে একটা স্ট্রিং তৈরি করো। সেটার মধ্যে উপরে ডিক্লেয়ার করা ভেরিয়েবল এর মান ডাইনামিক ভাবে বসাও। একইভাবে উপরে একটা অবজেক্ট ডিক্লেয়ার করো। এবং ডাইনামিকভাবে উপরের অবজেক্ট এর দুইটা প্রপার্টি এর মান তোমার টেমপ্লেট স্ট্রিং এর মধ্যে বসাও।
const phone = {
  name: "iphone",
  model: "13proMax",
  price: 25000,
  color: "pink",
};

const ditles = `Phone ${phone.name},,Color ${phone.color}.`;
// console.log(ditles);

//৩.১ একটা প্যারামিটার ওয়ালা arrow ফাংশন ডিক্লেয়ার করো। এবং সেই ফাংশনের কাজ হবে তুমি কোন ইনপুট দিলে সেই ইনপুট সংখ্যাকে ৫ দিয়ে ভাগ করে আউটপুট দিবে।

// const into = (x) => x / 5;
// console.log(into(10));

//৩.২ তুমি দুইটা প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন লিখবে। সেই ফাংশনের ভিতরে কাজ হবে। প্রত্যেকটা ইনপুট প্যারামিটার এর সাথে ২ যোগ করবে তারপর যোগফল দুইটা গুণ করবে। ক্যামনে করবে সেটা চিন্তা করে বের করার চেষ্টা করো

// const num5 = (x, y) => (x + 2) * (y + 2);
// const total = num5(2, 3);
//  console.log(total);

//৩.৩ এইবার তিনটা প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন ডিক্লেয়ার করো। যেই ফাংশনের কাজ হবে তিনটা প্যারামিটার নিয়ে সেই তিনটা প্যারামিটারকে গুণ করে সেই রেজাল্ট রিটার্ন করবে।
// const num6 = (x, y, z) => x * y * z;
// const total1 = num6(2, 3, 5);
// console.log(total1);

//৩.৪ এইবার দুইটা প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন নিবে। ওই arrow ফাংশনটা হবে অনেকগুলা লাইনের। সেখানে প্রত্যেকটা ইনপুট প্যারামিটার এর সাথে ২ যোগ করবে তারপর যোগফল দুইটা গুণ করবে। ক্যামনে করবে সেটা চিন্তা করে বের করার চেষ্টা করো।

const number = (x, y) => {
        const xx=x+2;
        const yy=y+2;
        const total=xx*yy;
        return total ;
};

console.log(number(2,4));
